# Запрашиваем у пользователя два целых числа
a = int(input("Введите первое целое число a: "))
b = int(input("Введите второе целое число b: "))

# Вычисляем результаты математических операций
сумма = a + b
разница = a - b
произведение = a * b
частное = a / b
остаток = a % b
степень = a ** b

# Выводим результаты на экран
print("Сумма a и b:", сумма)
print("Разница a и b:", разница)
print("Произведение a и b:", произведение)
print("Частное от деления a и b:", частное)
print("Остаток от деления a и b:", остаток)
print("a в степени b:", степень)